package dz_4;
//Задание
//
//Пусть дан LinkedList с несколькими элементами. Реализуйте метод, который вернет “перевернутый” список.
//Реализуйте очередь с помощью LinkedList со следующими методами:enqueue() - помещает элемент в конец очереди, dequeue() - возвращает первый элемент из очереди и удаляет его, first() - возвращает первый элемент из очереди, не удаляя.
//Формат сдачи: файл с расширением java или ссылка на гит с подписанными ФИ и номером группы.
public class Ex001 {
    public static void main(String[] args) {

    }
}
